# SymbolId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkNode..::..SymbolId Property
LinkNode Class See Also
---
Identifies the Id of the symbol associated with the node.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElementId SymbolId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SymbolId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ SymbolId {
	ElementId^ get ();
}
```

# See Also
LinkNode Class
Autodesk.Revit.DB Namespace